[
  {
    "link": "https://spb.hh.ru/vacancy/79110906?from=vacancy_search_list&query=python",
    "salary": "4 000 – 6 000 EUR",
    "text": "Ищу Python Developer в SportTech компанию Sportradar. Sportradar - крупнейший провайдер спортивных данных в мире, работают с FIFA, UEFA, NBA, NHL, ITF и многими другими. Торгуются на Nasdaq. Нанятый человек присоединится к annotation/labeling команде в computer vision продуктах, состоящей из 3 SW Engineers, 1 MLOps и 1 Product Manager’а, команда скоро пополнится отдельным Data Engineer. Annotation является частью более крупной команды Automated content, состоящей из 70 человек (аналитика, дополненная реальность). Продукт и задачиРазработка data annotation/labeling инструментов для датасетов, инфраструктурных data processing сервисов. С инженерной точки зрения это работа с API, DB, разработка бэкенда для управляющего UI (желающим развиваться как фуллстек разработчик, возможно, смогут дать frontend задачи). Стек: Python, Flask, PostgreSQL, SQLAlchemy, AWS, Docker, Terraform, Gitlab Pipelines. ТребованияРазговорный английскийОпыт разработки бэкенда от 3х летОпыт разработки на Python от 2х летОпыт работы с SQL DB (Postgres, MySQL, иные)Плюсом будет: Flask, AWS, опыт разработки инфраструктурных сервисов. Этапы интервью30 минут звонок с рекрутером, я проверю англ, отвечу на вопросы, уточню пожелания.После 2 инженера проведут техническое интервью (1-2 собеседования). УсловияПервые 6 месяцев работа удаленная, по b2b контракту.ЗП до 6k EUR gross + после 6 мес, RSU и годовой бонус (об этом ниже).После - релокация с официальным трудоустройством на Кипр или в Словению, возможно в Сербию. Также добавляются Испания, Австрия, Германия, Польша, Словакия. Условия в этих странах варьируются, например где-то есть фитнес в офисе, где-то нет. Где-то будет сложнее устроить человека, где-то проще.К ЗП добавится страховка, годовой бонус до 10% (обычно он в районе 6-8%), RSU в размере ~30% от годового дохода, а вот пересмотра фиксированной части ЗП в сторону увеличения, скорее всего, не будет.Часы работы гибкие, нужно пересекаться в часы, о которых договоритесь с командой.Посещение офиса от 3х дней в неделю. Если поселитесь очень далеко, то можно попробовать договориться на меньше.",
    "company": "4CV Recruitment Services",
    "city": "Москва"
  },
  {
    "link": "https://spb.hh.ru/vacancy/79248533?from=vacancy_search_list&query=python",
    "salary": "200 000 – 350 000 руб.",
    "text": "Бизнес-Азимут является опытным экспертом в проведении аналитических работ в ИТ-проектах, анализе и подготовке документации, системной интеграции, разработке ПО, а также в предоставлении высококвалифицированных ИТ-специалистов для решения широкого спектра задач. Вы нам подходите, если:   Ваш опыт коммерческой разработки на Python не менее 4 лет;   Вы владеете хотя бы одним из фреймворков: AioHttp, Sanic, FastApi, Starlette, Django, Flask, etc.   Уверенно знаете Linux на уровне пользователя.   Пишете SQL-запросы без использования ORM.   Обязанности:   Выполнять задачи по разработке программных решений в web и мобильных приложениях на основании технических заданий, полученных от функциональных консультантов и в соответствии с регламентами ведения разработок;   Разрабатывать unit тесты;   Cопровождать, документировать и эксплуатировать разработанные приложения;   Оказывать консультации по техническим вопросам в web и мобильных приложениях;   Выявлять дефекты и находить причины их возникновения;   Разрабатывать варианты решения проблем и устранения инцидентов и дефектов;   Предоставлять периодические отчеты о своей деятельности непосредственному и функциональному руководителям.   Условия:  График работы 5/2, готовность работать по Московскому времени;  Работа удаленно!   Заработная плата до 350 000 рублей на руки;  Мы - аккредитованная ИТ-компания (льготная ипотека и прочие блага); Обучение за счет компании; СБЕРЗДОРОВЬЕ ДМС Премии \"Приведи друга\", \"Порекомендуй проект\" от 50000 рублей; Подарки на День Рождения от компании; Корпоративы для всех сотрудников; Поддержка на всех этапах работы;  Отсутствие бюрократии, простая и прозрачная схема работы;   Все проекты недавно стартанули, без громоздкого legaсy;   Новые и востребованные технологии;   Перспективы карьерного и профессионального роста;   Возможность прокачать свои навыки на крупном федеральном проекте;   Интересные, местами сложные и разнообразные задачи.  ",
    "company": "Бизнес-Азимут",
    "city": "Москва"
  },
  {
    "link": "https://spb.hh.ru/vacancy/78926884?from=vacancy_search_list&query=python",
    "salary": "70 000 – 100 000 руб.",
    "text": "В онлайн-гипермаркет требуется Python-разработчик на удаленную работу с интересными задачами. Обязанности:  Разработка кода по ТЗ и задачам - интеграции по API, обработка данных, поддержка БД; Настройка исполнения периодических скриптов (программ) и их мониторинг; Составление инструкций по работе с кодом и связанным процессами; Работа с облачным хранилищем, расширение и управление дисками (Linux, SSH); Администрирование баз (управление пользователями, добавление/удаление баз, мониторинг); Небольшие задачи системного администрирования.  Требования:  Опыт программирования на Python от 3 лет; Знание JupiterHUB, Postgree, MySQL, Linux; Опыт работы с API, Pandas, интеграций с сервисами (например CRM+маршкетплейс); Умение рассмотреть задачу со всех сторон; Отличная самоорганизация; Приветствуется опыт Flask, Django.  Условия:  Удаленная работа с гибким графиком, полный день; Почасовая оплата по трекеру, выплаты на ИП или самозанятого (налоги берем на себя); Квартальные бонусы по итогам выполнения проектов; Большое количество интеллектуальных задач; Оперативный контакт с руководителями; Размер оплаты зависит от эффективности работы и опыта.  Если Вас заинтересовала вакансия, прошу дать ответы на вопросы. Представьте себе гипотетические ситуации: 1) К Вам приходит коллега и задает вопрос: \"Нет отклика от базы данных\". Т.е. коллега делает запрос в таблицу БД Postgree и ничего не происходит. (Важно понимать, что коллега умеет обращаться с БД на уровне пользователя). Какие конкретные действия вы предпримите для разрешения проблем? 2) Перед вами стоит задача отправить данные из таблицы по API на удаленный сервер. Опишите алгоритм действий.",
    "company": "РусЭкспресс",
    "city": "Москва"
  },
  {
    "link": "https://spb.hh.ru/vacancy/79208677?from=vacancy_search_list&query=python",
    "salary": "от 200 000 руб.",
    "text": "Команда VisionLabs бурно развивается и мы хотим дополнить нашу дружную research команду python разработчиком, способным взять на себя решение части задач, возникающих во время исследований. Чем предстоит заниматься:   Основная задача – разработка прототипов продуктов на основе технологий, созданных исследователями;   написание приложений для сбора и разметки данных;   развитие инфраструктуры для прокачки и обработки данных.   Что для этого потребуется:  python, в том числе для веб-разработки (Flask | FastAPI | Django); технологии баз данных (PostgreSQL | MongoDB); уверенное владение Docker, Docker Compose, MQ, Nginx; богатый опыт работы с ОС семейства Linux; креативность и желание постоянно осваивать новые технологии; умение оптимально и быстро достигать поставленной цели; ожидаем за плечами опыт разработки 3+ лет.  Плюсом будет:   опыт web-разработки;   опыт программирования на C++   Готовы предложить:  Высокий уровень дохода и ежеквартальное премирование; Соблюдение ТК, белая заработная плата; ДМС и другие приятные дополнения; Классную команду, а также крутые и перспективные продукты; Возможна полностью удаленная работа, гибридный график или работа в комфортном офисе рядом с м. Курская, Чкаловская; Огромное количество интересных задач.  О VisionLabs:   лидер в компьютерном зрении с прицелом на международный рынок;   годами не опускаемся ниже top-3 по качеству и скорости распознавания лиц на самом репрезентативном тесте NIST (более 50 вендоров);   свой фреймворк для инференса нейронных сетей с низкоуровневыми оптимизациями и квантованием, упрощающий внедрения;   организатор ежегодной конференции “Machines Can See” http://machinescansee.com;   амбициозные планы по международной экспансии (HQ - Амстердам, sales offices - Россия, Сингапур, ОАЭ, Япония, США). Сеть партнеров в 38 странах;   доля международной выручки более 50% и растёт;   офисы разработки в Москве (ст. м. Курская) и Амстердаме.   Тут можно послушать про наши технологии:   overview technology, products, use-cases: https://youtu.be/COPi36bh7XE   face recognition: https://youtu.be/5jmrj4G63Fo   liveness: https://youtu.be/7xyMP_5eA8c?t=1629   re-id: https://www.youtube.com/watch?v=9vmZHxUHG7E   neural nets acceleration: https://youtu.be/ogHrgixuFzg?t=1876   object detection: https://youtu.be/jukZAtyJJ64?t=9192   распознавание жестов: https://www.youtube.com/watch?v=O3vpe4yqrwI&t=12s  ",
    "company": "ООО ВижнЛабс (VisionLabs)",
    "city": "Москва"
  },
  {
    "link": "https://spb.hh.ru/vacancy/78703350?from=vacancy_search_list&query=python",
    "salary": "90 000 – 140 000 руб.",
    "text": "Обязанности:  Разработка и развитие продуктов компании как для внутреннего, так и для коммерческого использования;  Требования:  Опыт разработки от 2-х лет на Python 3; Опыт работы с фреймворком Django; Опыт написания юниттестов; Опыт написания SQL запросов; Опыт работы с GIT; Понимание Celery, RabbitMQ; Хорошее знание GNU/Linux; Хорошее знание HTML/CSS/JS.  Условия:  Позитивный коллектив; График работы ПН - ПТ с 9.00 до 18.00; Много интересных и сложных задач; ",
    "company": "Визардсофт",
    "city": "Санкт-Петербург"
  },
  {
    "link": "https://spb.hh.ru/vacancy/79051528?from=vacancy_search_list&query=python",
    "salary": "от 100 000 руб.",
    "text": "Занимаемся разработкой коммерческих проектов в сферах торговли, логистики, склада, управления. Нам необходим опытный программист для разработки крупных проектов. Сервисная архитектура, разделение front / back.   Задачи:  Проектирование архитектуры сервисов, API Разработка бизнес логики Оптимизация кода    Требования:  Уверенное владение Python 3+ и опыт коммерческой разработки от года Фреймворки: FastAPI, Tornado, Flask или аналог ORM: SQLAlchemy, django, или аналог Хорошее знание SQL Знание классических алгоритмов и структур данных Опыт работы с СУБД Linux Опыт написания unit тестов Git Ответственность  Будет плюсом:  CI/CD RabbitMQ    Условия:  Молодой, дружный коллектив; Работаем по SCRUM; Заработная плата обсуждается индивидуально по результатам собеседования (зависит от опыта и знаний) График работы 5/2, 9:00-18:00, 10:00-19:00 удаленно ( 1-2 раза в месяц встреча в офисе в МСК); Новый проект; Возможность процессионального и карьерного роста.  Внимание! На первом этапе Вам будет предложено выполнить небольшое тестовое задание.  ",
    "company": "Own Script",
    "city": "Москва"
  }
]